["The Onion Looks Back On The Greatest Quarterback To Lose 3 Super Bowls", "Greatest NFL Playoff Moments", "San Jose To Become First City In U.S. To Require Gun Insurance", "Editorial Cartoon: ‘Poll Dancers’", "U.S. Sends Military Advisors To Peace-Ravaged Country", "Red Flags To Look For When Booking An Airbnb", "Woman Disgusted By Magazine’s Glaring Use Of Photoshop In Spot-The-Difference Picture Game", "Crypto Executives Assuage Environmental Concerns By Unveiling Digital Avatar Of Glacier", "Community Hopes Killing 2 In Drunk-Driving Accident Serves As Wake-Up Call To Promising Young Rich Kid", "Jesus Christ Starts Rival Eternal Paradise After Family Rift", "NASA Gently Lowers Hot Dog On Fishing Line Into Black Hole", "Elite Selective Hospital Only Accepts 9% Of ICU Applicants", "Things You Should Never Say To Someone Who Makes Minimum Wage", "Spectators Cheer As Zookeeper Throws Fish To Very Chubby Boy", "Dusty Can Of Bamboo Shoots In Back Of Cabinet Last Remaining Trace Of Woman’s Withered Cooking Ambitions", "Pittsburgh Honors Ben Roethlisberger With Commemorative Statue In Women’s Bathroom", "Police Flip Through Unsolved Crimes To See What Else They Can Pin On Mentally Disabled Man", "Mom Believes New Boyfriend Could Give Son Positive Father Figure For Solid Couple Months", "Man Hoping His Death Fucked Up Enough That He Gets Law Named After Him", "Chinese Man Unsure If ‘Godzilla Vs. Kong’ Actually That Bad Or If Government Altered It", "Nude Woman Pleasantly Surprised To See Self Represented In Art Museum’s Collection", "Mitch McConnell Blocks Justice Stephen Breyer From Retiring", "Timeline Of Joe Biden’s First Year In Office", "Poll: Average U.S. Horse Still Prefers Carrot To Photo Of Biden", "Biden Meets With Senate Democrats To Discuss Breaking Up Supreme Court Nominee And Confirming Her In Parts", "Nancy Pelosi Introduces Landmark Legislation To Provide Aid For Struggling Personal Stock Portfolio", "CEOs Predict The Future Of The Metaverse", "Signs Your Child’s School Is Not Prepared For Covid-19", "What To Say To Someone Who Refuses To Vote", "Things You Should Never Say To An ICU Nurse", "Hey Gamers, We Know We Can Sometimes Be A Little One-Note About Gaming So If You Ever Want To Talk About Something Else, Like Baking Or Whatever, Just Know We’re Down", "Games Bring People Together: We Don’t Have Any Specific Story Right Now That Proves This Point, But We Wanted To Express The General Sentiment", "Bad News Gamers: It Appears Now Is Not The Time For Idle Merriment", "Be Cool, For Once, Gamers: Mrs. Thompson Said We Might Get to Play ‘Minecraft’ If We Finish The Quiz By 11:45", "Tips For Dealing With Depression From Our Coworker Who’s Clearly Going Through Some Stuff Pt. 1", "Scientists Say One Day Dropping Your Phone In The Toilet Could Also Recharge It", "Questions I'm Always Asked As A 58-Year-Old Gen Z-er", "Cop Explains How It Feels To Live Every Day In Fear Someone Might Record You Brutalizing A Civilian", "Tips For Dealing With Depression From Our Coworker Who’s Clearly Going Through Some Stuff Pt. 1", "Celebrities Explain Why They Are Investing In Crypto", "Special Orders Chefs Hate The Most And Why", "Adele Postpones Vegas Residency Rather Than Give Up Seat At Hot Slot Machine", "The Onion Looks Back On The Greatest Quarterback To Lose 3 Super Bowls", "Greatest NFL Playoff Moments", "‘Let’s Clear Some Cap Space,’ Says Stone-Faced Bill Belichick Watching Players Dig Own Graves", "Despondent Buffalo Fan Wonders If Day Will Ever Come When He Too Blackout Drunk To Remember Bills Super Bowl Victory", "Tennessee School District Bans Holocaust Graphic Novel ‘Maus’", "San Jose To Become First City In U.S. To Require Gun Insurance", "SpaceX Rocket Part On Collision Course With Moon", "China Changes ‘Fight Club’ Ending To Have Authorities Win"]