["Teen Pilot Becomes Youngest Woman To Fly Around World Solo", "What To Say To Someone Who Refuses To Vote", "Timeline Of Joe Biden’s First Year In Office", "Editorial Cartoon: ‘Sobering Effects’", "CEOs Predict The Future Of The Metaverse", "Woman Feeling Doubly Conflicted About Attending ‘Harry Potter’-Themed Plantation Wedding", "Biden Vows That If Russia Invades Ukraine, U.S. Will Invade One Country Of Equivalent Value", "Obnoxious Toddler Really Rubbing His Childlike Sense Of Wonder In Everyone’s Faces", "Vacationing Woman Asks Friend To Assume Identity For Next Couple Weeks", "Leaked Documents Confirm ExxonMobil Has Known Exactly Which Day Earth Ends Since The 1970s", "Vacationing Woman Asks Friend To Assume Identity For Next Couple Weeks", "Nestlé Announces Consumers Free To Sexualize Raisinets All They Want", "Adele Postpones Vegas Residency Rather Than Give Up Seat At Hot Slot Machine", "New NFL-Military Partnership Sends First 1,000 Fans To Stand For National Anthem Off To War", "Dad Doesn’t Approve Of Direction Mall Headed In", "Chicago City Workers Clear Ice By Pouring Hot Beef Drippings Onto Roads", "Frustrated Hospital Worker Rounds Up Gurneys Patients Failed To Put in Parking Lot Corrals", "Neglected Dog Always Wearing Same Clothes", "Bank Hostages Whining As If They Not Getting Whole Day Off Work", "Los Angeles Residents Giddy After Learning Big Hollywood Movie Being Shot In Their Town", "The Onion’s Guide To Socially Responsible Investing", "Poll: Average U.S. Horse Still Prefers Carrot To Photo Of Biden", "Congress Addresses Child Care Crisis By Loosening Restrictions On Locking Children In Car For 8 Hours", "Biden Vows Not To Forget Lessons Of January 6: ‘We Must Hang Mike Pence’", "U.S. Democracy Under Siege After Tech Lobbyist Invites Some Senators To Dinner", "Contractor Informs Biden It’d Be Cheaper To Just Tear Down U.S. And Start Over", "Signs Your Mother-In-Law Actually Hates You", "Abortion Laws In Every State", "Lies Fitness Trainers Tell Their Clients All The Time", "Lies Men Will Tell To Get You To Sleep With Them", "Hey Gamers, We Know We Can Sometimes Be A Little One-Note About Gaming So If You Ever Want To Talk About Something Else, Like Baking Or Whatever, Just Know We’re Down", "Games Bring People Together: We Don’t Have Any Specific Story Right Now That Proves This Point, But We Wanted To Express The General Sentiment", "Bad News Gamers: It Appears Now Is Not The Time For Idle Merriment", "Be Cool, For Once, Gamers: Mrs. Thompson Said We Might Get to Play ‘Minecraft’ If We Finish The Quiz By 11:45", "Enjoy This Free TikTok Cooling Station", "Is It Ethical For Prenatal Testing To Tell You If Your Baby Will Be Too Annoying To Love?", "We Invited Logan Paul And BTS To Collab On A Video With Us And They Crashed Into Each Other On The Way Over", "How Do Self-Driving Cars Avoid Driving Straight To The Beach?", "Adele Postpones Vegas Residency Rather Than Give Up Seat At Hot Slot Machine", "‘People’ Editor Sweating Bullets After Dedicating Next Issue To Alan Alda’s 86th Birthday", "Rock & Roll Hall Of Fame Under Pressure To Return Looted Ancient Mesopotamian Stratocaster", "Incompetent Film Director Totally Obscures Face Of Person Committing Murder", "New NFL-Military Partnership Sends First 1,000 Fans To Stand For National Anthem Off To War", "NFL Expands Super Bowl To Include 2 Additional Teams", "PGA Golfer Hoping To Hit The Office If Round Finishes Early", "Star High School Quarterback Blissfully Unaware He’ll Be Jets Starter 4 Years From Now", "Theodore Roosevelt Statue Removed From Natural History Museum", "Teen Pilot Becomes Youngest Woman To Fly Around World Solo", "M&Ms Characters Redesigned For ‘More Dynamic, Progressive World’", "Ancient ‘Scepters’ Actually Drinking Straws For Communal Boozing, Say Researchers"]